{
    "premieres-versions-adaptatives-des-api-javascript-geoportail": {
        "date": "2023-06-30",
        "title": "Premières versions adaptatives des API JavaScript Geoportail",
        "thumbnail_url": "build/img/actualites/1.png",
        "thumbnail_alt": "Plan IGN centré sur Saint-Jean-de-Luz",
        "thumbnail_caption": "Source : IGN",
        "tags": [
            "geoportail",
            "api"
        ],
        "short_description": "Les premières versions adaptatives des API JavaScript Géoportail à l'arrêt de l'autoconfiguration ont été publiées. La majorité des adaptations sont transparentes* pour les utilisateurs par rapport aux dernières versions publiées.",
        "content": "<p>                Les premières versions adaptatives des API JavaScript Géoportail à l'arrêt de l'autoconfiguration ont été publiées. La majorité des adaptations                sont transparentes* pour les utilisateurs par rapport aux dernières versions publiées.            </p>            Voici les numéros des nouvelles versions publiées (github et npm) :            <ul>                <li>                    Bibliothèque d'accès aux services Géoportail :                    <a href=\"https://github.com/IGNF/geoportal-access-lib/releases/tag/3.3.1\" target=\"_blank\" title=\"Bibliothèque d'accès aux services Géoportail 3.3.1 - ouvre une nouvelle fenêtre\" rel=\"noopener\">3.3.1</a>                </li>                <li>                    Extensions Géoportail pour OpenLayers :                    <a href=\"https://github.com/IGNF/geoportal-extensions/releases/tag/ol-3.3.1\" target=\"_blank\" title=\"Extensions Géoportail pour OpenLayers 3.3.1 - ouvre une nouvelle fenêtre\" rel=\"noopener\">3.3.1</a>                </li>                <li>                    Extensions Géoportail pour Leaflet :                    <a href=\"https://github.com/IGNF/geoportal-extensions/releases/tag/leaflet-2.3.2\" target=\"_blank\" title=\"Extensions Géoportail pour Leaflet 2.3.2 - ouvre une nouvelle fenêtre\" rel=\"noopener\">2.3.2</a>                </li>                <li>                    Extensions Géoportail pour iTowns :                    <a href=\"https://github.com/IGNF/geoportal-extensions/releases/tag/itowns-2.4.1\" target=\"_blank\" title=\"Extensions Géoportail pour iTowns 2.4.1 - ouvre une nouvelle fenêtre\" rel=\"noopener\">2.4.1</a>                </li>                <li>SDK Géoportail : <a href=\"https://github.com/IGNF/geoportal-sdk/releases/tag/3.4.1\" target=\"_blank\" title=\"SDK Géoportail 3.4.1 - ouvre une nouvelle fenêtre\" rel=\"noopener\">3.4.1</a></li>            </ul>            <p>                De nouvelles versions des API JavaScript Geoportail seront publiées au cours de l’été 2023. Ces versions permettront d’utiliser les nouvelles                URL d'appel des flux et services de la Géoplateforme ainsi que son système d’authentification. Cette seconde montée de version sera à réaliser                avant fin 2023 afin que les API JavaScript Géoportail continuent de fonctionner dans vos applications.            </p>            Comme annoncé en mars dernier, dans le cadre de la bascule vers l’infrastructure de la Géoplateforme, les API JavaScript Géoportail sont impactées            par deux changements :            <ol>                <li>                    Le premier est la fin du service d'autoconfiguration. Les API JavaScript Géoportail (extensions et SDK) s'appuient actuellement sur ce                    service pour implémenter les fonctionnalités d'ajout simplifié des couches de données cartographiques servies par l'IGN. Un contournement                    est aujourd’hui proposé dans ces nouvelles versions publiées des API JavaScript Géoportail. La prise en compte des dernières versions dans                    l’application devra impérativement être effectuée d'ici décembre 2023. Le volume de modifications à réaliser dans l’application dépendra de                    la version actuellement utilisée (*). Nous vous conseillons de la réaliser le plus tôt possible.                </li>                <li>                    Le second est la migration des données vers la nouvelle infrastructure et, de ce fait, la création de nouvelles URL pour accéder aux                    services, qu'il faudra donc mettre à jour dans les API JavaScript Géoportail. Une fois disponible, les utilisateurs de l’API auront alors                    jusqu’à fin d’année 2023 pour réaliser la mise à niveau de leur application vers cette seconde version adaptative des API JavaScript                    Géoportail.                </li>            </ol>            <p>                La seconde version adaptative des API JavaScript qui sera publiée durant l’été 2023 intégrera les adaptations proposées par la première version                adaptative. Il sera donc possible de réaliser la mise à niveau à partir de la seconde version (*). Elle devra être faite impérativement avant                fin 2023.            </p>            <p>Les échéances ci-dessus ne pourront pas faire l’objet de reports. Nous vous invitons donc vivement à les anticiper.</p>            <p>                Si vous avez besoin de plus détails techniques, il existe un                <a                    href=\"https://www.developpez.net/forums/d2145836/applications/sig-systeme-d-information-geographique/ign-api-geoportail/questions-autour-adaptations-api-javascript-geoportail-cadre-geoplateforme/#post11951206\"                    target=\"_blank\" title=\"Article dédié - ouvre une nouvelle fenêtre\" rel=\"noopener\"                >                    article dédié                </a>                qui fournit des réponses à vos questions.            </p>            <p>Pour toutes autres demandes, <a href=\"https://geoservices.ign.fr/contact\">contactez-nous</a></p>            <em>                (*) Nous conseillons aux utilisateurs de l’API qui utilisent des versions très datées des API JavaScript Géoportail de commencer d’ores et déjà                les actions de mise à niveau vers les dernières versions actuellement publiées.            </em>"
    },
    "avancement-du-programme-lidar-hd-publication-des-premieres-donnees-classees": {
        "date": "2023-07-21T12:09:09.000Z",
        "title": "Avancement du programme LiDAR HD : publication des premières données classées",
        "thumbnail_url": "build/img/actualites/2.png",
        "thumbnail_alt": "Exemple de rendu de données LiDAR",
        "thumbnail_caption": "Source : IGN",
        "tags": [
            "LidarHD",
            "3D"
        ],
        "short_description": "Depuis le 6 juin, vous pouvez accéder sur le site Géoservices aux premières données classées du programme.",
        "content": "<p>                Depuis le 6 juin, vous pouvez accéder sur le site                <a href=\"https://geoservices.ign.fr/lidarhd\" target=\"_blank\" title=\"Programme LiDAR HD sur Géoservices - ouvre une nouvelle fenêtre\" rel=\"noopener\">Géoservices</a> aux premières données classées du programme.            </p>            <p>                Dans ces données, chaque point mesuré en 3D dans le nuage est classé selon sa nature (sol, eau, bâtiment, végétation, pont…), selon 12 classes.                Cette production itérative est permise grâce à un processus de classification automatisé composé de routines algorithmiques. Ces dernières sont                à posteriori vérifiées par apprentissage profond, ou deep learning. Une explication claire et concise est disponible sur le                <a href=\"https://www.youtube.com/watch?v=H2643uZ3Hug\" target=\"_blank\" title=\"Replay du webinaire - ouvre une nouvelle fenêtre\" rel=\"noopener\">replay</a> du webinaire national qui a eu lieu le mardi 6                juin dernier.            </p>            <p>                La diffusion des premiers (blocs de) nuages de points classés en open data sur le site Géoservices de l'IGN constitue un jalon important dans le                programme national LiDAR HD et pour les porteurs de politiques publiques sponsors du programme. Cette nouvelle information enrichit le nuage de                points LiDAR HD et facilite son exploitation par des traitements automatiques. Par exemple, les points classés « sol » vont permettre de générer                les modèles numériques de terrain nécessaires à la prévention et au suivi du risque inondation, les points classés « sol » et « végétation »                vont directement alimenter les cartes utiles à la gestion forestière, etc. Plus généralement, cette nouvelle information permet par exemple de                faciliter les modélisations du terrain, du bâti ou de la végétation sur une zone donnée, notamment par la capacité de focaliser des analyses sur                des classes particulières.            </p>            <p>                Un peu plus d’une dizaine de blocs sont aujourd’hui accessibles en nuages de points classés (soit une surface de 28 200 km²), d’autres blocs                vont être diffusés progressivement, en priorité sur les zones volées entre l’été 2021 et l’été 2022. Les données sont diffusées par dalle                kilométrique au format LAZ, accessibles directement par flux dans QGIS, ou bien en téléchargement pour un usage hors connexion par exemple. Les                produits dérivés (MNT, MNS et MNH) sont en cours d’industrialisation et de production, y compris sur les zones classées et diffusées. Les                premiers produits devraient être diffusés dans une première version à l’automne 2023. En parallèle, les acquisitions se poursuivent sur le                territoire national, la Haute Normandie est en cours d’acquisition. Cet été des acquisitions sont prévues sur les Landes, la Gironde et la                Réunion. Cette                <a href=\"https://macarte.ign.fr/carte/322ea69dab4c7e5afabc6ec7043b5994/acquisitionslidarhd\" target=\"_blank\" title=\"Carte d'avancement - ouvre une nouvelle fenêtre\" rel=\"noopener\">carte</a> vous permet                de retrouver l’avancement des acquisitions.            </p>            <p>                Pour en savoir plus sur la nouvelle étape franchie dans la cartographie 3D de la France, accédez au                <a href=\"https://www.ign.fr/espace-presse/une-nouvelle-etape-franchie-dans-la-cartographie-3d-de-la-france\" target=\"_blank\" title=\"Communiqué de presse - ouvre une nouvelle fenêtre\" rel=\"noopener\"                    >communiqué de presse</a                >.            </p>            <p>                Pour plus d'informations, veuillez consulter le site                <a href=\"https://geoservices.ign.fr/lidarhd\" target=\"_blank\" title=\"Programme LiDAR HD sur Géoservices - ouvre une nouvelle fenêtre\" rel=\"noopener\">Géoservices</a> de l'IGN et                <a href=\"https://geoservices.ign.fr/rejoindre-la-communaute-lidar-hd\" target=\"_blank\" title=\"Rejoignez la communauté LiDAR HD - ouvre une nouvelle fenêtre\" rel=\"noopener\">rejoignez la communauté Lidar HD</a>.            </p>"
    },
    "quand-lia-se-met-au-service-des-enjeux-environnementaux-aidez-nous-a-relever-le-defi": {
        "date": "2023-07-21T12:09:09.000Z",
        "title": "Quand l’IA se met au service des enjeux environnementaux : aidez-nous à relever le défi !",
        "thumbnail_url": "build/img/actualites/3.png",
        "thumbnail_alt": "FLAIR #2 Challenge AI | May 25th - September 25th, 2023",
        "thumbnail_caption": "Source : IGN",
        "tags": [
            "IA",
            "environnement",
            "FLAIR"
        ],
        "short_description": "Constitué par l’IGN, FLAIR (French Land cover from Aerospace ImageRy) est l’un des plus importants jeux de données géospatiales France entière réalisé pour entrainer des modèles IA sur l’occupation du sol, avec 50 départements couverts et plus de 20 milliards de pixels annotés d'images ortho aériennes à très haute résolution.",
        "content": "<strong>Quelle est la nouveauté de cette seconde édition ?</strong>        <p>            Les candidats auront accès au dataset FLAIR et à près de 50 000 acquisitions multi-dates provenant des satellites Sentinel-2 du programme européen            Copernicus !        </p>        <strong>3 raisons de relever le défi FLAIR 2 :</strong>        <ol>            <li>Vous challenger !</li>            <li>Contribuer à construire des solutions IA innovantes autour des données d’observation de la Terre, au service de défis environnementaux,</li>            <li>                Nous aider à augmenter la qualité de classification du modèle IA actuel, basé sur l’imagerie aérienne, et explorer de possibles synergies avec                les images satellites.            </li>        </ol>        <strong>Vous souhaitez participer ou relayer ce challenge ?</strong>        <p>FLAIR 2 est ouvert du 25 mai au 25 septembre 2023 sur la plateforme Codalab ! 10 000 € seront à partager entre les 3 premiers gagnants.</p>        <p>Alors rendez-vous dès maintenant sur <a href=\"https://codalab.lisn.upsaclay.fr/competitions/13447\" target=\"_blank\" title=\"CodaLab - ouvre une nouvelle fenêtre\" rel=\"noopener\">CodaLab</a> !</p>        <img            src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Flag_of_Great_Britain_%281707%E2%80%931800%29.svg/64px-Flag_of_Great_Britain_%281707%E2%80%931800%29.svg.png\"            alt=\"UK Flag\"            width=\"40px\"        />        <p>            Constituted by the IGN, FLAIR (French Land cover from Aerospace ImageRy) is one of the largest country-scale geospatial datasets, containing more            than over 20 billion annotated pixels of very high resolution aerial imagery, for training AI models on land cover mapping!        </p>        <strong>What's new in this 2nd edition?</strong>        <p>            Candidates will have access to the FLAIR dataset and to nearly 50 000 multi-date acquisitions from Sentinel-2 satellites of the European Copernicus            program !        </p>        <strong>3 reasons to take up FLAIR 2:</strong>        <ol>            <li>Challenge yourself!</li>            <li>Contribute to building innovative AI solutions around Earth observation data, serving major environmental issues,</li>            <li>                Help us increase the classification quality of the current AI model, based on #AerialImagery, and explore possible synergies with                SatelliteImagery.            </li>        </ol>        <strong>Are you motivated to participate or would like to share this challenge?</strong>        <p>FLAIR 2 is open from 25 May to 25 September 2023 on Codalab platform! 10,000 € in prize money will be split among the top 3 winners.</p>        <p>Visit <a href=\"https://codalab.lisn.upsaclay.fr/competitions/13447\" target=\"_blank\" title=\"CodaLab - ouvre une nouvelle fenêtre\" rel=\"noopener\">CodaLab</a> now for more details!</p>"
    }
}
