{
    "l-sepace-co-evolue": {
        "date": "2023-10-23T08:00:00.000Z",
        "title": "L’espace collaboratif évolue !",
        "tags": ["Collaboratif"],
        "thumbnail_url": "build/img/actualites/6.png",
        "thumbnail_alt": "Extrait de carte du réseau routier",
        "short_description": "L’espace Collaboratif, outil en ligne pour enrichir vos bases de données collaboratives, va prochainement intégrer <strong>Cartes.gouv.fr</strong>",
        "content": "<p><strong>Participez à l’amélioration des données, en signalant des évolutions ou des erreurs via une interface dédiée</strong></p> <p>L’espace collaboratif permet de faire contribuer des communautés à vos données comme de contribuer aux données de l’IGN. Parmi les capacités qui vous sont offertes vous pouvez notamment :</p><ul><li>participer à l’amélioration des données IGN, en signalant des évolutions ou des erreurs via une interface dédiée, à partir du site internet ou de l’application mobile.</li><li>gérer, administrer, faire évoluer le contenu de vos bases de données hébergées sur l'espace collaboratif sous forme de cartes, de tables et de fiches attributaires.</li><li>Accéder à l’ensemble des fonds cartographiques, et photographiques IGN, ou à vos propres données métiers à partir de votre interface personnalisée.</li></ul><p>Pour faciliter vos remontées, signalements et contributions à vos bases de données  l'IGN vous propose divers outils (site web, appli mobile, API) et plug in.</p><p>Pour aller plus loin, rendez-vous sur <a href=\"https://espacecollaboratif.ign.fr/\" target=\"_blank\" rel=\"noreferrer\" title=\"espacecollaboratif.ign.fr - ouvre une nouvelle fenêtre\">https://espacecollaboratif.ign.fr/</a></p><p><strong>L’espace collaboratif évolue !</strong></p> <p>L’espace collaboratif va rejoindre cartes.gouv. A cette occasion, des travaux sur le parcours utilisateur sont en cours. Ils visent à améliorer l’expérience utilisateur et à prendre en compte les besoins d’évolution des utilisateurs, en particulier une plus grande autonomie dans la mise en place des guichets.</p>"
    },
    "consultation_publique_un_guichet_cartographe_du_service_public": {
        "date": "2023-10-23T08:00:00.000Z",
        "title": "Consultation publique : Un guichet cartographe du service public",
        "tags": ["Macarte", "Consultation"],
        "thumbnail_url": "build/img/actualites/7.png",
        "thumbnail_alt": "Une vue de l'outil MaCarte",
        "short_description": "Ma Carte, outil en ligne de création et de publication de cartes, ouvert et mis à disposition de tous par l’IGN, s’enrichit de nouvelles fonctionnalités. <strong>Cartes.gouv.fr</strong> intégrera à terme ce service pour vous permettre de créer vos cartes plus simplement à partir des données de la communauté <strong>Géoplateforme</strong>.  Contribuez à la consultation publique pour partager vos usages et nous aider à améliorer l’outil.",
        "content": "<p>Lien vers l'article : <a href=\"https://www.ign.fr/agenda/consultation-publique-le-guichet-cartographe-du-service-public-en-questions\" target=\"_blank\" rel=\"\noreferrer\" title=\"Consultation Ma Carte - ouvre une nouvelle fenêtre\">Consultation publique : le guichet cartographe du service public en questions - Portail IGN - IGN</a></p>"    
    },
    "replay_presentation_de_la_premiere_version_du_site_cartes.gouv.fr": {
        "date": "2023-10-23T08:00:00.000Z",
        "title": "Replay: Présentation de la première version du site Cartes.gouv.fr",
        "tags": ["Cartes.gouv.fr", "Replay"],
        "thumbnail_url": "build/img/actualites/8.png",
        "thumbnail_alt": "Vue de la première version du site Cartes.gouv.fr",
        "short_description": "Retour sur le temps d’information en ligne dédié à la première version de <strong>Cartes.gouv.fr</strong> du 26 septembre 2023",
        "content": "<p><strong>Lien vers l'article : </strong><a href=\"https://www.ign.fr/geoplateforme/debrief/presentation-de-la-premiere-version-du-site-cartesgouvfr\" target=\"_blank\" rel=\"noreferrer\" title=\"Présentation du site cartes.gouv.fr - ouvre une nouvelle fenêtre\">Présentation de la première version du site <strong>Cartes.gouv.fr</strong> - Programme <strong>Géoplateforme</strong> - IGN</a></p>"
    },
    "communaute-des_utilisateurs_de_la_geoplateforme": {
        "date": "2023-10-23T08:00:00.000Z",
        "title": "Communauté des utilisateurs de la Géoplateforme",
        "tags": ["Communauté", "Géoplateforme","Cartes.gouv.fr"],
        "thumbnail_url": "build/img/actualites/9.jpg",
        "thumbnail_alt": "La Géoplateforme",
        "short_description": "Retour sur le temps d’information en ligne dédié à la première version de <strong>Cartes.gouv.fr</strong> du 26 septembre 2023",
        "content": "<p>Retrouvez la communauté des utilisateurs de la <strong>Géoplateforme</strong> pour <strong>suivre les actualités, communiquer entre membres engagés et découvrir les créations et les pratiques collectives.</strong>N’attendez plus et venez rejoindre les communautés d’utilisateurs !</p><p><strong>Lien vers l'article : </strong><a href=\"https://www.ign.fr/geoplateforme/rejoindre-la-communaute\" target=\"_blank\" rel=\"noreferrer\" title=\"Rejoindre la communauté Géoplateforme - ouvre une nouvelle fenêtre\">Rejoindre la communauté <strong>Géoplateforme</strong> - Programme <strong>Géoplateforme</strong> - IGN</a></p>"
    },
    "decouvrez_l_offre_geoplateforme": {
        "date": "2023-10-23T08:00:00.000Z",
        "title": "Découvrez l’offre Géoplateforme et Cartes.gouv.fr",
        "tags": ["Offre", "Géoplateforme","Cartes.gouv.fr"],
        "thumbnail_url": "build/img/actualites/10.png",
        "thumbnail_alt": "La Géoplateforme, c'est quoi ?",
        "short_description": "Les premières fonctionnalités de la <strong>Géoplateforme</strong> et de <strong>Cartes.gouv.fr</strong> sont déployées, parcourez la présentation de l’offre <strong>Géoplateforme</strong> et <strong>Cartes.gouv.fr</strong> pour mieux comprendre le programme et anticiper vos usages.",
        "content": "<p>Face aux enjeux contemporains, la carte est un outil de médiation majeur. Le service public de la cartographie, pour révéler ce potentiel, doit s’engager à mettre à disposition de tous, citoyens et acteurs des territoires, les cartes et applications données qui nourrissent la réflexion et guident l’action.</p><p>Le site <strong>Cartes.gouv.fr</strong> lancé à l’automne 2023 porte cette ambition. Il offrira progressivement à tous un accès centralisé aux géodonnées souveraines et aux fonctionnalités de référence pour créer, héberger, contribuer, partager, visualiser et publier des données et des cartes, créer, héberger, enrichir ou diffuser des données et des services géographiques.En parallèle, l’IGN développe la <strong>Géoplateforme</strong>, une infrastructure, la <strong>Géoplateforme</strong>, ouverte et collaborative mutualisée pour l’hébergement, le partage, le traitement et la mise en cartographie des géodonnées. Le site <strong>Cartes.gouv.fr</strong> s’appuie sur cette nouvelle plateforme : il en est en quelque sorte la vitrine principale (mais pas exclusive) tout autant qu’un pupitre de commande accessible à tous.Découvrez plus en détail l’offre de la <strong>Géoplateforme</strong> et de <strong>Cartes.gouv.fr</strong> pour mieux anticiper votre usage en parcourant la présentation ci-dessous :[AJOUTER PRESENTATION GEOPLATEFORME QUAND PRETE]</p>"
    },
    "quand-lia-se-met-au-service-des-enjeux-environnementaux-aidez-nous-a-relever-le-defi": {
        "date": "2023-07-21T12:09:09.000Z",
        "title": "Quand l’IA se met au service des enjeux environnementaux : aidez-nous à relever le défi !",
        "thumbnail_url": "build/img/actualites/3.png",
        "thumbnail_alt": "FLAIR #2 Challenge AI | May 25th - September 25th, 2023",
        "thumbnail_caption": "Source : IGN",
        "tags": [
            "IA",
            "environnement",
            "FLAIR"
        ],
        "short_description": "Constitué par l’IGN, FLAIR (French Land cover from Aerospace ImageRy) est l’un des plus importants jeux de données géospatiales France entière réalisé pour entrainer des modèles IA sur l’occupation du sol, avec 50 départements couverts et plus de 20 milliards de pixels annotés d'images ortho aériennes à très haute résolution.",
        "content": "<p><strong>Quelle est la nouveauté de cette seconde édition ?</strong></p><p>Les candidats auront accès au dataset FLAIR et à près de 50 000 acquisitions multi-dates provenant des satellites Sentinel-2 du programme européen Copernicus !</p><p><strong>3 raisons de relever le défi FLAIR 2 :</strong></p><ol><li>Vous challenger !</li><li>Contribuer à construire des solutions IA innovantes autour des données d’observation de la Terre, au service de défis environnementaux,</li><li>Nous aider à augmenter la qualité de classification du modèle IA actuel, basé sur l’imagerie aérienne, et explorer de possibles synergies avec les images satellites.</li></ol><p><strong>Vous souhaitez participer ou relayer ce challenge ?</strong></p><p>FLAIR 2 est ouvert du 25 mai au 25 septembre 2023 sur la plateforme Codalab ! 10 000 € seront à partager entre les 3 premiers gagnants.</p><p>Alors rendez-vous dès maintenant sur <a href=\"https://codalab.lisn.upsaclay.fr/competitions/13447\" target=\"_blank\" title=\"CodaLab - ouvre une nouvelle fenêtre\" rel=\"noreferrer\">CodaLab</a> !</p><img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Flag_of_Great_Britain_%281707%E2%80%931800%29.svg/64px-Flag_of_Great_Britain_%281707%E2%80%931800%29.svg.png\" alt=\"UK Flag\" width=\"40px\"/><p>Constituted by the IGN, FLAIR (French Land cover from Aerospace ImageRy) is one of the largest country-scale geospatial datasets, containing more            than over 20 billion annotated pixels of very high resolution aerial imagery, for training AI models on land cover mapping!</p><p><strong>What's new in this 2nd edition?</strong></p><p>Candidates will have access to the FLAIR dataset and to nearly 50 000 multi-date acquisitions from Sentinel-2 satellites of the European Copernicus program!</p><p><strong>3 reasons to take up FLAIR 2:</strong></p><ol><li>Challenge yourself!</li><li>Contribute to building innovative AI solutions around Earth observation data, serving major environmental issues,</li><li>Help us increase the classification quality of the current AI model, based on #AerialImagery, and explore possible synergies with SatelliteImagery.</li></ol><strong>Are you motivated to participate or would like to share this challenge?</strong><p>FLAIR 2 is open from 25 May to 25 September 2023 on Codalab platform! 10,000 € in prize money will be split among the top 3 winners.</p><p>Visit <a href=\"https://codalab.lisn.upsaclay.fr/competitions/13447\" target=\"_blank\" title=\"CodaLab - ouvre une nouvelle fenêtre\" rel=\"noreferrer\">CodaLab</a> now for more details!</p>"
    },
    "avancement-du-programme-lidar-hd-publication-des-premieres-donnees-classees": {
        "date": "2023-07-21T12:09:09.000Z",
        "title": "Avancement du programme LiDAR HD : publication des premières données classées",
        "thumbnail_url": "build/img/actualites/2.png",
        "thumbnail_alt": "Exemple de rendu de données LiDAR",
        "thumbnail_caption": "Source : IGN",
        "tags": [
            "LidarHD",
            "3D"
        ],
        "short_description": "Depuis le 6 juin, vous pouvez accéder sur le site Géoservices aux premières données classées du programme.",
        "content": "<p>Depuis le 6 juin, vous pouvez accéder sur le site <a href=\"https://geoservices.ign.fr/lidarhd\" target=\"_blank\" title=\"Programme LiDAR HD sur Géoservices - ouvre une nouvelle fenêtre\" rel=\"noreferrer\">Géoservices</a> aux premières données classées du programme.</p><p>Dans ces données, chaque point mesuré en 3D dans le nuage est classé selon sa nature (sol, eau, bâtiment, végétation, pont…), selon 12 classes. Cette production itérative est permise grâce à un processus de classification automatisé composé de routines algorithmiques. Ces dernières sont à posteriori vérifiées par apprentissage profond, ou deep learning. Une explication claire et concise est disponible sur le <a href=\"https://www.youtube.com/watch?v=H2643uZ3Hug\" target=\"_blank\" title=\"Replay du webinaire - ouvre une nouvelle fenêtre\" rel=\"noreferrer\">replay</a> du webinaire national qui a eu lieu le mardi 6 juin dernier.</p><p>La diffusion des premiers (blocs de) nuages de points classés en open data sur le site Géoservices de l'IGN constitue un jalon important dans le programme national LiDAR HD et pour les porteurs de politiques publiques sponsors du programme. Cette nouvelle information enrichit le nuage de points LiDAR HD et facilite son exploitation par des traitements automatiques. Par exemple, les points classés « sol » vont permettre de générer les modèles numériques de terrain nécessaires à la prévention et au suivi du risque inondation, les points classés « sol » et « végétation » vont directement alimenter les cartes utiles à la gestion forestière, etc. Plus généralement, cette nouvelle information permet par exemple de faciliter les modélisations du terrain, du bâti ou de la végétation sur une zone donnée, notamment par la capacité de focaliser des analyses sur des classes particulières.</p><p>Un peu plus d’une dizaine de blocs sont aujourd’hui accessibles en nuages de points classés (soit une surface de 28 200 km²), d’autres blocs vont être diffusés progressivement, en priorité sur les zones volées entre l’été 2021 et l’été 2022. Les données sont diffusées par dalle kilométrique au format LAZ, accessibles directement par flux dans QGIS, ou bien en téléchargement pour un usage hors connexion par exemple. Les produits dérivés (MNT, MNS et MNH) sont en cours d’industrialisation et de production, y compris sur les zones classées et diffusées. Les premiers produits devraient être diffusés dans une première version à l’automne 2023. En parallèle, les acquisitions se poursuivent sur le territoire national, la Haute Normandie est en cours d’acquisition. Cet été des acquisitions sont prévues sur les Landes, la Gironde et la Réunion. Cette <a href=\"https://macarte.ign.fr/carte/322ea69dab4c7e5afabc6ec7043b5994/acquisitionslidarhd\" target=\"_blank\" title=\"Carte d'avancement - ouvre une nouvelle fenêtre\" rel=\"noreferrer\">carte</a> vous permet de retrouver l’avancement des acquisitions.</p><p>Pour en savoir plus sur la nouvelle étape franchie dans la cartographie 3D de la France, accédez au <a href=\"https://www.ign.fr/espace-presse/une-nouvelle-etape-franchie-dans-la-cartographie-3d-de-la-france\" target=\"_blank\" title=\"Communiqué de presse - ouvre une nouvelle fenêtre\" rel=\"noreferrer\">communiqué de presse</a>.</p><p>Pour plus d'informations, veuillez consulter le site <a href=\"https://geoservices.ign.fr/lidarhd\" target=\"_blank\" title=\"Programme LiDAR HD sur Géoservices - ouvre une nouvelle fenêtre\" rel=\"noreferrer\">Géoservices</a> de l'IGN et <a href=\"https://geoservices.ign.fr/rejoindre-la-communaute-lidar-hd\" target=\"_blank\" title=\"Rejoignez la communauté LiDAR HD - ouvre une nouvelle fenêtre\" rel=\"noreferrer\">rejoignez la communauté Lidar HD</a>.</p>"
    },
    "lancement-de-l-observatoire-des-forets-francaises": {
        "date": "2023-07-10T08:00:00.000Z",
        "title": "Lancement de l'Observatoire des forêts françaises",
        "thumbnail_url": "build/img/actualites/4_1.jpg",
        "thumbnail_alt": "Carte du taux de boisement communal",
        "short_description": "Un outil de partage des connaissances au service des forêts dans le contexte du changement climatique, incluant de nombreuses cartes et services inédits.",
        "content": "<p> Le 10 juillet 2023, <a href=\"https://foret.ign.fr/\">l’Observatoire des forêts françaises</a> a été officiellement lancé à l’Institut national de l’information géographique et forestière (IGN) par Marc Fesneau, ministre de l’Agriculture et de la Souveraineté alimentaire et Christophe Béchu, ministre de la Transition écologique et de la Cohésion des territoires. </p><p> Décidé en mars 2022 lors des <a href=\"https://agriculture.gouv.fr/cloture-des-assises-de-la-foret-et-du-bois\" target=\"_blank\" rel=\"noreferrer\" title=\"Assises de la forêt et du bois - ouvre une nouvelle fenêtre\">Assises de la forêt et du bois</a>, cet observatoire est porté par 5 grands acteurs du domaine : l’IGN, l’Office national des forêts (ONF), le Centre national de la propriété forestière (CNPF), France Bois Forêt, l’Office français de la biodiversité (OFB), sous l’égide du Ministère de l’Agriculture et de la Souveraineté alimentaire et du Ministère de la Transition écologique et de la Cohésion des territoires. Il a pour vocation de constituer un centre de partage et de production de données indispensables pour le pilotage des forêts françaises en rassemblant les expertises et les connaissances sur la forêt. </p><p> Destiné aussi bien aux professionnels qu’au grand public, son site en accès libre (<a href=\"https://foret.ign.fr/\" target=\"_blank\" rel=\"noreferrer\" title=\"foret.ign.fr - ouvre une nouvelle fenêtre\">foret.ign.fr</a>) propose ainsi une information de référence sur les grands enjeux actuels, ainsi que des cartes et des services innovants pour la connaissance et la gestion des forêts à l’échelle des territoires dans le contexte de changement climatique. </p><p>L’Observatoire est une initiative novatrice qui répond au besoin crucial d’un espace centralisé et dédié à l’information forestière. Identifié lors des Assises de la forêt et du bois en mars 2022, il est commun aux acteurs du secteur de la forêt et du bois. Alors que la forêt est de plus en plus considérée comme une ressource précieuse, source de biens et de services économiques, sociaux, climatiques et environnementaux majeurs, et que le changement climatique fait peser sur elle des menaces existentielles, cet observatoire vise à relever le défi de la connaissance pour dresser un état détaillé de la forêt, suivre et anticiper ses évolutions et accompagner les acteurs forestiers dans leurs choix de gestion face au dérèglement climatique.</p><h2>Rassembler les expertises et les connaissances</h2> <p> Concrètement, l’Observatoire des forêts françaises rassemble désormais en un espace unique les expertises et les connaissances. Il constitue tout d’abord un espace d’échange et de production en commun d’informations, de croisement, et d’analyses thématiques nationales ou régionales. <strong>Cinq premiers clubs thématiques ont été créés, dédiés à la santé des forêts, aux incendies, aux ressources en bois, à l’adaptation au changement climatique et à son atténuation.</strong> Pour chacun de ces grands axes, l’ambition est de proposer l’information de référence en un lieu unique, en mobilisant des experts et un laboratoire d’idées sur la production d’analyses et la fourniture de services. </p><p> Le <a href=\"https://foret.ign.fr/\" target=\"_blank\" rel=\"noreferrer\" title=\"Observatoire des forêts françaises - ouvre une nouvelle fenêtre\">site de l’Observatoire des forêts françaises</a> rassemble cette information thématisée, fiable et actualisée issue de ces expertises collectives. Il permet la diffusion des informations et des données clé en main, produites par l’ensemble des partenaires fournisseurs de données, en commençant par les données de l’inventaire forestier national produites en continu par l’IGN. Il offre également des services numériques, précieux pour l’aide à la décision publique : la forêt de mon territoire, la carte interactive, l’annuaire des acteurs. D'autres services sont pressentis dans le futur avec de nombreuses opportunités, notamment pour faciliter les politiques à devancer le changement climatique ou encore un accès au jeune public et aux enseignants. </p><img src=\"/build/img/actualites/4_2.jpg\" width=\"100%\" alt=\"Page d'accueil du site de l’Observatoire des forêts françaises\"/> <h2>Un premier pas vers un jumeau numérique de la forêt française</h2> <p>S’il a prouvé la volonté et la capacité des acteurs à se mobiliser pour améliorer ensemble l’information forestière au service de la planification écologique, le lancement de cet observatoire n’est qu’un début. Pour éclairer les décisions face à des attentes parfois contradictoires, l’Observatoire, véritable outil d'appui, va s’enrichir en continu de données et d’analyses scientifiques sur de multiples thèmes en lien avec les objectifs de la politique nationale forestière et au regard des besoins spécifiques des acteurs forestiers. À plus long terme, une initiative comme l’Observatoire préfigure le système national d’information forestière qui permettra de tester les décisions futures : un jumeau numérique permettant de suivre la forêt en temps réel mais également de simuler divers scenarii climatiques et techniques pour que celle-ci reste un atout face au changement climatique dans le cadre d'une gestion durable, agile, et multifonctionnelle.</p><h2>Un écosystème mobilisé !</h2> <p>L’Observatoire est piloté par l‘IGN en partenariat avec l’ONF, le CNPF, France Bois Forêt, l’OFB, sous l’égide du ministère de l’Agriculture et de la Souveraineté alimentaire et du ministère de la Transition Ecologique et de la Cohésion des territoires. Il associe largement les acteurs de la filière forêt-bois réuni notamment au sein du comité de la filière forêt-bois de l'IGN.</p><p> <strong>Le site de l’Observatoire</strong> : <a href=\"https://foret.ign.fr/\" target=\"_blank\" rel=\"noreferrer\" title=\"foret.ign.fr - ouvre une nouvelle fenêtre\">https://foret.ign.fr/</a> </p><p> <strong>Pour rejoindre la communauté</strong> : <a href=\"https://foret.ign.fr/rejoindre-communaute-des-utilisateurs\" target=\"_blank\" rel=\"noreferrer\" title=\"Rejoindre la communauté - ouvre une nouvelle fenêtre\">https://foret.ign.fr/rejoindre-communaute-des-utilisateurs</a> </p><p>La communauté des utilisateurs de l'Observatoire est ouverte à tous les acteurs de la forêt :</p><ul> <li>pour donner votre avis et proposer vos suggestions,</li><li>pour prendre part aux débats,</li><li>pour poser vos questions et trouver de l'aide et des astuces,</li><li>pour suivre toute l'actualité de l'observatoire et participer aux évènements.</li></ul> <p>Vos réactions permettront d'améliorer l'Observatoire des forêts françaises et de vous fournir un service public de qualité qui réponde à vos besoins.</p>"
    },
    "accedez-a-la-rediffusion-temps-d-information-geoplateforme": {
        "date": "2023-07-10T08:00:00.000Z",
        "title": "Accédez à la rediffusion des temps d’information Géoplateforme",
        "thumbnail_url": "build/img/actualites/5.png",
        "thumbnail_alt": "Les temps forts de la <strong>Géoplateforme</strong> en replay",
        "short_description": "L’IGN organise des temps d’information et d’échanges dans le cadre de la <strong>Géoplateforme</strong>.",
        "content":"<p>Des occasions de vous partager l’ambition de la <strong>Géoplateforme</strong>, les expérimentations et les nouvelles fonctionnalités à travers la prise de parole d’experts ou de témoignages partenaires.</p><p>Ces temps d'information vous offrent l’opportunité d'interagir directement avec nos experts.</p><p>Consultez notre <a href=\"https://www.ign.fr/geoplateforme/debriefs-geoplateforme\"/>page débriefs</a> pour accéder aux rediffusions.</p>"
    },
    "premieres-versions-adaptatives-des-api-javascript-geoportail": {
        "date": "2023-06-30T08:00:00.000Z",
        "title": "Premières versions adaptatives des API JavaScript Geoportail",
        "thumbnail_url": "build/img/actualites/1.png",
        "thumbnail_alt": "Plan IGN centré sur Saint-Jean-de-Luz",
        "thumbnail_caption": "Source : IGN",
        "tags": [
            "geoportail",
            "api"
        ],
        "short_description": "Les premières versions adaptatives des API JavaScript Géoportail à l'arrêt de l'autoconfiguration ont été publiées. La majorité des adaptations sont transparentes* pour les utilisateurs par rapport aux dernières versions publiées.",
        "content": "<p>Les premières versions adaptatives des API JavaScript Géoportail à l'arrêt de l'autoconfiguration ont été publiées. La majorité des adaptations sont transparentes<a href=\"footnote1\">*</a> pour les utilisateurs par rapport aux dernières versions publiées.</p><p>Voici les numéros des nouvelles versions publiées (github et npm) :</p><ul><li>Bibliothèque d'accès aux services Géoportail : <a href=\"https://github.com/IGNF/geoportal-access-lib/releases/tag/3.3.1\" target=\"_blank\" title=\"Bibliothèque d'accès aux services Géoportail 3.3.1 - ouvre une nouvelle fenêtre\" rel=\"noreferrer\">3.3.1</a></li><li>Extensions Géoportail pour OpenLayers : <a href=\"https://github.com/IGNF/geoportal-extensions/releases/tag/ol-3.3.1\" target=\"_blank\" title=\"Extensions Géoportail pour OpenLayers 3.3.1 - ouvre une nouvelle fenêtre\" rel=\"noreferrer\">3.3.1</a></li><li>Extensions Géoportail pour Leaflet : <a href=\"https://github.com/IGNF/geoportal-extensions/releases/tag/leaflet-2.3.2\" target=\"_blank\" title=\"Extensions Géoportail pour Leaflet 2.3.2 - ouvre une nouvelle fenêtre\" rel=\"noreferrer\">2.3.2</a></li><li>Extensions Géoportail pour iTowns : <a href=\"https://github.com/IGNF/geoportal-extensions/releases/tag/itowns-2.4.1\" target=\"_blank\" title=\"Extensions Géoportail pour iTowns 2.4.1 - ouvre une nouvelle fenêtre\" rel=\"noreferrer\">2.4.1</a></li><li>SDK Géoportail : <a href=\"https://github.com/IGNF/geoportal-sdk/releases/tag/3.4.1\" target=\"_blank\" title=\"SDK Géoportail 3.4.1 - ouvre une nouvelle fenêtre\" rel=\"noreferrer\">3.4.1</a></li></ul><p>De nouvelles versions des API JavaScript Geoportail seront publiées au cours de l’été 2023. Ces versions permettront d’utiliser les nouvelles URL d'appel des flux et services de la <strong>Géoplateforme</strong> ainsi que son système d’authentification. Cette seconde montée de version sera à réaliser avant fin 2023 afin que les API JavaScript Géoportail continuent de fonctionner dans vos applications.</p><p>Comme annoncé en mars dernier, dans le cadre de la bascule vers l’infrastructure de la <strong>Géoplateforme</strong>, les API JavaScript Géoportail sont impactées par deux changements :</p><ol><li>Le premier est la fin du service d'autoconfiguration. Les API JavaScript Géoportail (extensions et SDK) s'appuient actuellement sur ce service pour implémenter les fonctionnalités d'ajout simplifié des couches de données cartographiques servies par l'IGN. Un contournement est aujourd’hui proposé dans ces nouvelles versions publiées des API JavaScript Géoportail. La prise en compte des dernières versions dans l’application devra impérativement être effectuée d'ici décembre 2023. Le volume de modifications à réaliser dans l’application dépendra de la version actuellement utilisée<a href=\"#footnote1\">*</a>. Nous vous conseillons de la réaliser le plus tôt possible.</li><li>Le second est la migration des données vers la nouvelle infrastructure et, de ce fait, la création de nouvelles URL pour accéder aux services, qu'il faudra donc mettre à jour dans les API JavaScript Géoportail. Une fois disponible, les utilisateurs de l’API auront alors jusqu’à fin d’année 2023 pour réaliser la mise à niveau de leur application vers cette seconde version adaptative des API JavaScript Géoportail.</li></ol><p>La seconde version adaptative des API JavaScript qui sera publiée durant l’été 2023 intégrera les adaptations proposées par la première version adaptative. Il sera donc possible de réaliser la mise à niveau à partir de la seconde version<a href=\"#footnote1\">*</a>. Elle devra être faite impérativement avant fin 2023.</p><p>Les échéances ci-dessus ne pourront pas faire l’objet de reports. Nous vous invitons donc vivement à les anticiper.</p><p>Si vous avez besoin de plus détails techniques, il existe un <a href=\"https://www.developpez.net/forums/d2145836/applications/sig-systeme-d-information-geographique/ign-api-geoportail/questions-autour-adaptations-api-javascript-geoportail-cadre-geoplateforme/#post11951206\" target=\"_blank\" title=\"Article dédié - ouvre une nouvelle fenêtre\" rel=\"noreferrer\">article dédié</a> qui fournit des réponses à vos questions.</p><p>Pour toutes autres demandes, <a href=\"https://cartes.gouv.fr/nous-ecrire\">contactez-nous</a></p><p id=\"footnote1\"><em>* Nous conseillons aux utilisateurs de l’API qui utilisent des versions très datées des API JavaScript Géoportail de commencer d’ores et déjà les actions de mise à niveau vers les dernières versions actuellement publiées.</em></p>"
    }
}